#!/bin/bash

# Βρες τον αριθμο
# Εκδοση: 2
# Συγγραφεας: GNUTechie

# Ωρισμος του τυχαιου αριθμου (αυτου που ψαχνουμε)
randomnumber=$(shuf -i 1-10 -n 1)

#Μεταβλητη που μετραει τις προσπαθειες του χρηστη να βρει τον σωστο αριθμο.
tries=1

while true
do
  # εδω το προγραμμα ρωταει τον χρηστη για εναν αριθμο
  read -rp "Δώσε έναν αριθμό : " number
  # εαν ο αριθμος που εδωσε ο χρηστης ειναι ο σωστος αριθμος
  if [ $number -eq $randomnumber ];
  then
    # Εαν ο χρηστης το βρηκε με την πρωτη προσπαθεια
    if [ $tries -eq 1 ];
    then
       # εκτυπωσε το μυνημα αυτο
       echo "Το βρήκες με την πρωτη. Ο σωστος αριθμος ειναι: $number. Τυχη βουνο."
       break
    else
       # σε αντιθετη περιπτωση τοτε εκτυπωσε αυτο το μυνημα με την αριθμο τον προσπαθειων
       echo "Το βρήκες με την $triesη προσπαθεια. Ο σωστος αριθμος ειναι: $number"
       break
    fi
  else
    # Εαν ο χρηστης δωσει αριθμο που δεν ειναι ο ζητουμενος...

    # Εαν ο αριθμος ειναι εκτως οριων
    if [ $number -lt 1 ] || [ $number -gt 10 ];
    then
         # εκτυπωσε το συγκεκριμενο μυνημα και αυξησε τον αριθμο των προσπαθειων
         echo "Ο αριθμος $number ειναι εκτως οριων. Δεκτοι αριθμοι απο το 1 μεχρι το 10. Ξαναπροσπαθησε."
         tries=$(( $tries + 1 ))
    else
         # Σε αντιθετη περιπτωση εκτυπωσε αυτο το μυνημα και αυξησε τον αριθμο των προσπαθειων
         echo "Τσου. Ο αριθμος $number δεν ειναι ο σωστος. Ξαναπροσπαθησε."
         tries=$(( $tries + 1 ))
    fi
  fi
done

exit 0
